import os
import sqlite3
import random
from typing import Any, Dict, List
from pathlib import Path

# Путь к БД в директории mcp_server
BASE_DIR = Path(__file__).parent
DB_FILE = str(BASE_DIR / "products.db")


def get_connection() -> sqlite3.Connection:
    """Создать подключение к базе данных и настроить row_factory."""
    conn = sqlite3.connect(DB_FILE)
    conn.row_factory = sqlite3.Row
    return conn


def init_db() -> None:
    """
    Создать таблицу products (если нет) и при первом запуске
    заполнить её 100 тестовыми товарами.
    """
    first_time = not os.path.exists(DB_FILE)
    db_path = os.path.abspath(DB_FILE)
    print(f"[DB] Путь к БД: {db_path}")
    
    conn = get_connection()
    cur = conn.cursor()

    cur.execute(
        """
        CREATE TABLE IF NOT EXISTS products (
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            name TEXT NOT NULL,
            category TEXT NOT NULL,
            price REAL NOT NULL
        )
        """
    )
    conn.commit()

    # Если таблица пустая — заполняем реальными товарами
    cur.execute("SELECT COUNT(*) AS cnt FROM products")
    row = cur.fetchone()
    if row is not None and row["cnt"] == 0:
        print("[DB] Таблица пуста. Заполняю товарами...")
        
        # Список реальных товаров с категориями и ценами
        products_data = [
            # Продукты питания
            ("Чай", "Продукты", 150.0),
            ("Молоко", "Продукты", 85.0),
            ("Хлеб", "Продукты", 45.0),
            ("Яйца", "Продукты", 120.0),
            ("Масло", "Продукты", 180.0),
            ("Сахар", "Продукты", 95.0),
            ("Соль", "Продукты", 25.0),
            ("Мука", "Продукты", 65.0),
            ("Макароны", "Продукты", 75.0),
            ("Рис", "Продукты", 110.0),
            ("Гречка", "Продукты", 85.0),
            ("Овсянка", "Продукты", 70.0),
            ("Кофе", "Продукты", 450.0),
            ("Печенье", "Продукты", 120.0),
            ("Шоколад", "Продукты", 150.0),
            ("Йогурт", "Продукты", 95.0),
            ("Сыр", "Продукты", 320.0),
            ("Колбаса", "Продукты", 450.0),
            ("Яблоки", "Фрукты", 120.0),
            ("Бананы", "Фрукты", 140.0),
            ("Апельсины", "Фрукты", 160.0),
            ("Помидоры", "Овощи", 180.0),
            ("Огурцы", "Овощи", 150.0),
            ("Картофель", "Овощи", 60.0),
            ("Морковь", "Овощи", 70.0),
            ("Лук", "Овощи", 50.0),
            ("Капуста", "Овощи", 55.0),
            
            # Одежда
            ("Футболка", "Одежда", 800.0),
            ("Джинсы", "Одежда", 2500.0),
            ("Куртка", "Одежда", 4500.0),
            ("Пальто", "Одежда", 6000.0),
            ("Платье", "Одежда", 3500.0),
            ("Рубашка", "Одежда", 1800.0),
            ("Свитер", "Одежда", 2200.0),
            ("Шорты", "Одежда", 1200.0),
            ("Юбка", "Одежда", 1500.0),
            ("Брюки", "Одежда", 2800.0),
            ("Носки", "Одежда", 200.0),
            ("Перчатки", "Одежда", 600.0),
            ("Шапка", "Одежда", 800.0),
            ("Шарф", "Одежда", 500.0),
            
            # Обувь
            ("Кроссовки", "Обувь", 3500.0),
            ("Ботинки", "Обувь", 4500.0),
            ("Туфли", "Обувь", 4000.0),
            ("Сапоги", "Обувь", 5000.0),
            ("Тапочки", "Обувь", 800.0),
            ("Сандалии", "Обувь", 1500.0),
            ("Коньки", "Спорт", 2500.0),
            ("Лыжи", "Спорт", 8000.0),
            ("Велосипед", "Спорт", 15000.0),
            ("Мяч", "Спорт", 1200.0),
            ("Ракетка", "Спорт", 3000.0),
            ("Гантели", "Спорт", 2500.0),
            
            # Электроника
            ("Смартфон", "Электроника", 25000.0),
            ("Ноутбук", "Электроника", 45000.0),
            ("Планшет", "Электроника", 18000.0),
            ("Наушники", "Электроника", 3500.0),
            ("Клавиатура", "Электроника", 2500.0),
            ("Мышь", "Электроника", 1500.0),
            ("Монитор", "Электроника", 12000.0),
            ("Телевизор", "Электроника", 35000.0),
            ("Фотоаппарат", "Электроника", 28000.0),
            ("Часы", "Электроника", 8000.0),
            
            # Книги
            ("Роман", "Книги", 450.0),
            ("Детектив", "Книги", 380.0),
            ("Фантастика", "Книги", 420.0),
            ("Учебник", "Книги", 850.0),
            ("Словарь", "Книги", 650.0),
            ("Энциклопедия", "Книги", 1200.0),
            ("Комикс", "Книги", 350.0),
            ("Журнал", "Книги", 200.0),
            
            # Дом и быт
            ("Подушка", "Дом", 800.0),
            ("Одеяло", "Дом", 2500.0),
            ("Полотенце", "Дом", 600.0),
            ("Посуда", "Дом", 1500.0),
            ("Кастрюля", "Дом", 2200.0),
            ("Сковорода", "Дом", 1800.0),
            ("Чайник", "Дом", 1500.0),
            ("Ваза", "Дом", 1200.0),
            ("Лампа", "Дом", 1800.0),
            ("Зеркало", "Дом", 2500.0),
            ("Ковер", "Дом", 5000.0),
            ("Шторы", "Дом", 3500.0),
            
            # Игрушки
            ("Кукла", "Игрушки", 1200.0),
            ("Машинка", "Игрушки", 800.0),
            ("Конструктор", "Игрушки", 2500.0),
            ("Пазл", "Игрушки", 600.0),
            ("Мягкая игрушка", "Игрушки", 1500.0),
            ("Настольная игра", "Игрушки", 1800.0),
            ("Кубики", "Игрушки", 500.0),
            ("Погремушка", "Игрушки", 300.0),
        ]
        
        # Добавляем товары в БД
        for name, category, price in products_data:
            cur.execute(
                "INSERT INTO products (name, category, price) VALUES (?, ?, ?)",
                (name, category, price),
            )
        conn.commit()
        print(f"[DB] Добавлено {len(products_data)} товаров.")
    else:
        count = row["cnt"] if row is not None else 0
        print(f"[DB] В таблице уже есть {count} товаров.")

    conn.close()


def list_products() -> List[Dict[str, Any]]:
    """Вернуть список всех товаров."""
    conn = get_connection()
    cur = conn.cursor()
    cur.execute("SELECT * FROM products")
    rows = cur.fetchall()
    result = [dict(row) for row in rows]
    conn.close()
    return result


def find_product(name: str) -> List[Dict[str, Any]]:
    """Найти товары по подстроке в названии (регистронезависимо)."""
    conn = get_connection()
    cur = conn.cursor()
    # Убираем лишние пробелы и кавычки из поискового запроса
    name_clean = name.strip().strip('"').strip("'").lower()
    
    # Получаем все товары и фильтруем в Python для надежной работы с кириллицей
    cur.execute("SELECT * FROM products")
    all_rows = cur.fetchall()
    
    # Фильтруем товары, где название содержит искомую подстроку (регистронезависимо)
    result = []
    for row in all_rows:
        product_name = dict(row)["name"].lower()
        if name_clean in product_name:
            result.append(dict(row))
    
    conn.close()
    return result


def add_product(name: str, category: str, price: float) -> Dict[str, Any]:
    """Добавить товар и вернуть добавленную запись."""
    conn = get_connection()
    cur = conn.cursor()
    cur.execute(
        "INSERT INTO products (name, category, price) VALUES (?, ?, ?)",
        (name, category, price),
    )
    conn.commit()
    new_id = cur.lastrowid
    cur.execute("SELECT * FROM products WHERE id = ?", (new_id,))
    row = cur.fetchone()
    conn.close()
    return dict(row) if row is not None else {}


